IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_sdfm_regs.xml
	<register id="SDCOMP2EVT1FLTCLKCTL" width="16" page="1" offset="0x6c" internal="0" description="COMPH/CEVT1 Digital filter2 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP2LOCK" width="16" page="1" offset="0x6f" internal="0" description="SD  compartor event filter2 Lock Register">
		<bitfield id="SDCOMP2CTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP" description="COMPevent filter registers Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3CTL" width="16" page="1" offset="0x70" internal="0" description="SD Comparator event filter3 Control Register">
		<bitfield id="CEVT1DIGFILTSEL" description="High Comparator Trip Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CEVT2DIGFILTSEL" description="Low Comparator Trip Select" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT2FLTCTL" width="16" page="1" offset="0x71" internal="0" description="COMPL/CEVT2 Digital filter3 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT2FLTCLKCTL" width="16" page="1" offset="0x72" internal="0" description="COMPL/CEVT2 Digital filter3 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT1FLTCTL" width="16" page="1" offset="0x73" internal="0" description="COMPH/CEVT1 Digital filter3 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT1FLTCLKCTL" width="16" page="1" offset="0x74" internal="0" description="COMPH/CEVT1 Digital filter3 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3LOCK" width="16" page="1" offset="0x77" internal="0" description="SD  compartor event filter3 Lock Register">
		<bitfield id="SDCOMP3CTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP" description="COMPevent filter registers Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4CTL" width="16" page="1" offset="0x78" internal="0" description="SD Comparator event filter4 Control Register">
		<bitfield id="CEVT1DIGFILTSEL" description="High Comparator Trip Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CEVT2DIGFILTSEL" description="Low Comparator Trip Select" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT2FLTCTL" width="16" page="1" offset="0x79" internal="0" description="COMPL/CEVT2 Digital filter4 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT2FLTCLKCTL" width="16" page="1" offset="0x7a" internal="0" description="COMPL/CEVT2 Digital filter4 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT1FLTCTL" width="16" page="1" offset="0x7b" internal="0" description="COMPH/CEVT1 Digital filter4 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT1FLTCLKCTL" width="16" page="1" offset="0x7c" internal="0" description="COMPH/CEVT1 Digital filter4 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4LOCK" width="16" page="1" offset="0x7f" internal="0" description="SD  compartor event filter4 Lock Register">
		<bitfield id="SDCOMP4CTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP" description="COMPevent filter registers Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
</module>
